app/controllers/admin/dashboard_controller.rb

  def index

    @model = OpenStruct.new :total_posts_private => Post.private.size,
                            :total_posts_public => Post.public.size,
							:themes => getthemes
---
SELECT count(*) AS count_all FROM `posts` WHERE (published = 'f' or published = 0)