app/controllers/posts_controller.rb

SELECT * FROM `posts` WHERE (published = 't' or published = 1) ORDER BY created_at DESC LIMIT 0, 5
SELECT count(*) AS count_all FROM `posts` WHERE (published = 't')
---
  def index
    if( current_user != nil )
      @posts = Post.paginate( :page => params[:page], :order => 'created_at DESC' )

SELECT * FROM `posts` WHERE (`posts`.`permalink` = 'quick-protip-explore-current-directory-from-command-line') AND (published = 't') LIMIT 1
---
  def show
    if( current_user != nil )
      @post = Post.find_by_permalink(params[:slug])

SELECT * FROM `posts` WHERE (published = 1) ORDER BY created_at DESC LIMIT 5, 5
SELECT count(*) AS count_all FROM `posts` WHERE (published = 1)
---
  def page
    if( current_user != nil )
      @posts = Post.paginate( :page => params[:page], :order => 'created_at DESC' )

SELECT * FROM `posts` WHERE (published = 1) ORDER BY created_at DESC LIMIT 10
---
  def rss
    @posts = Post.public.find(:all, :order => 'created_at DESC', :limit => 10)

INSERT INTO `posts` (`permalink`, `created_at`, `title`, `body`, `updated_at`, `published`, `summary`) VALUES('Your-New-Posts-Title', '2011-05-01 03:19:45', 'Your New Posts\' Title', '\n	 <p>Your main body should fully realize the ideas you set into motion in the introduction section. Keep your posts short\n	 and to the point as shorter blog posts are easier to read and remember.</p>\n	 \n	 <p>Use a consistent style in your writing, once you\'ve picked a style that suites you and your audience, stick to it.</p>\n	 \n	 <p>Be your own editor. Before you publish your post, go back and re-read it. Does it sound like you? Does it make sense? Does it get right to the point?</p>\n	', '2011-05-01 03:19:45', 0, '\n	 Write 2-3 sentences to grab your readers\' attention. The ending should act as an introduction into your main body. \n	')
---
  def create
    @post = Post.new

    @post.title = params[:post_title]
    @post.summary = params[:post_summary]
    @post.body = params[:post_body]

    respond_to do |format|
      if @post.save

SELECT * FROM `posts` WHERE (`posts`.`id` = '216') LIMIT 1
---
  def edit
	@post = Post.find_by_id(params[:id])

SELECT * FROM `posts` WHERE (`posts`.`id` = 107)
UPDATE `posts` SET `updated_at` = '2011-05-12 03:03:06', `title` = 'That Keyword', `permalink` = 'That-Keyword', `body` = '<p>\r\n	Brian Keller <a href=\"http://blogs.msdn.com/briankel/archive/2004/09/23/233212.aspx\" target=\"_blank\">posed a question</a> to the readers of his blog asking what we thought, if there were such a thing, the &quot;that&quot; keyword should do in C#. What a fantastic idea! My suggestion - the that keyword would be used to allow access to inherited classes from the base class.</p>\r\n<pre class=\"prettyprint\">\r\npublic class MyBase\r\n{\r\n public MyBase()\r\n {\r\n 	//only call CallToMethod() in a specific class\r\n 	if( typeof(that).ToString().Equals(&quot;MyChild&quot;) )\r\n 		that.CallToMethod();\r\n }\r\n}\r\n\r\npublic class MyChild : MyBase\r\n{\r\n public void CallToMethod()\r\n {\r\n // more code goes here...\r\n }\r\n}</pre>\r\n<p>\r\n	Yeah I know it&#39;s really dangerous and would definitely have some overhead associated with it but the functionality would be awesome!</p>\r\n' WHERE `id` = 111
---
  def update
    @post = Post.find(params[:id])

    @post.title = params[:title] if not params[:title].blank?
    @post.summary = params[:summary] if not params[:summary].blank?
    @post.body = params[:content] if not params[:content].blank?
    @post.published = params[:post_published] if not params[:post_published].blank?

	logger.debug params[:date_type]
	logger.debug params[:post_created_at]

	should_change_date = params[:date_type].blank? ? false : params[:date_type] != "default"
	if should_change_date
		if params[:date_type] == "today"
			@post.created_at = Date.today
		else
			@post.created_at = Date.parse params[:post_created_at]
		end
	end

    respond_to do |format|
      if @post.save

SELECT * FROM `posts` WHERE (`posts`.`id` = 108)
DELETE FROM `posts` WHERE `id` = 108
---
  def destroy
    @post = Post.find(params[:id])
    @post.destroy