app/controllers/sessions_controller.rb

SELECT * FROM `users`
---
  def new
    redirect_to :controller => "users", :action => "new" and return if User.all.size == 0