app/controllers/users_controller.rb

  def new
	@count = User.all.size
---
SELECT * FROM `users`

  def create
    logout_keeping_session!
    @user = User.new(params[:user])

    success = @user && @user.save
---
INSERT INTO `users` (`name`, `salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `remember_token`, `login`, `email`) VALUES('', '16f871a749078c3de1af94df3698c0e2165aad47', '2011-05-01 02:46:41', '4549f9c4b09ad388129321310bc53516d3735ac6', NULL, '2011-05-01 02:46:41', NULL, 'codeimpossible', 'jared.m.barboza@gmail.com')